; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v11)
             (pred_11 ?v8 ?v7)
             (pred_6 ?v13 ?v7)
             (pred_9 ?v6 ?v13 )
	     (pred_7 ?v13)
             (pred_5 ?v9)
             (pred_2 ?v8)
             (pred_3 ?v7)
             (pred_1 ?v13)
             (pred_8 ?v8)
             (pred_12 ?v13)
             (pred_4 ))



(:action op_3
:parameters (?v10 ?v3 ?v12 ?v2)
:precondition (and (pred_5 ?v10) (pred_5 ?v3) (pred_2 ?v12) (pred_3 ?v2)
          (pred_10 ?v10 ?v3) (pred_11 ?v12 ?v2)
                   (pred_6 ?v3 ?v2) (pred_7 ?v10) 
                   (pred_1 ?v3) (pred_8 ?v12))
:effect (and  (pred_12 ?v3) (not (pred_1 ?v3))))


(:action op_4
:parameters (?v10 ?v1)
:precondition (and (pred_5 ?v10) (pred_5 ?v1)
               (pred_7 ?v10) (pred_10 ?v10 ?v1) (pred_12 ?v1))
:effect (and (pred_7 ?v1) (not (pred_7 ?v10))))

(:action op_1
:parameters (?v10 ?v12)
:precondition (and (pred_5 ?v10) (pred_2 ?v12) 
                  (pred_7 ?v10) (pred_9 ?v12 ?v10) (pred_4 ))
:effect (and (pred_8 ?v12)
   (not (pred_9 ?v12 ?v10)) (not (pred_4 ))))


(:action op_2
:parameters (?v10 ?v5 ?v4)
:precondition (and (pred_5 ?v10) (pred_2 ?v5) (pred_2 ?v4)
                  (pred_7 ?v10) (pred_8 ?v4) (pred_9 ?v5 ?v10))
:effect (and (pred_8 ?v5) (pred_9 ?v4 ?v10)
        (not (pred_8 ?v4)) (not (pred_9 ?v5 ?v10))))

(:action op_5
:parameters (?v10 ?v12)
:precondition (and (pred_5 ?v10) (pred_2 ?v12) 
                  (pred_7 ?v10) (pred_8 ?v12))
:effect (and (pred_4 ) (pred_9 ?v12 ?v10) (not (pred_8 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_02 obj_18 obj_11 obj_10 obj_05 obj_09 obj_16 obj_03 obj_20 obj_15 obj_17 obj_19 obj_07 obj_14 obj_01
    obj_06 obj_12
    obj_04 obj_08
    )

    (:init
       (pred_4)

       (pred_5 obj_13)
       (pred_5 obj_02)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_05)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_17)
       (pred_5 obj_19)
       (pred_5 obj_07)
       (pred_5 obj_14)
       (pred_5 obj_01)
       (pred_3 obj_06)
       (pred_3 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_08)

       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_18)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_02)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_05 obj_20)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_20 obj_05)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_15 obj_14)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_14 obj_15)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_01 obj_14)
       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_6  obj_05 obj_06)
       (pred_6  obj_03 obj_12)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_09)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_01)

       (pred_11  obj_04 obj_06)
       (pred_11  obj_08 obj_12)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_08 obj_17)
       (pred_7 obj_14)
    )

    (:goal (and
       (pred_9 obj_08 obj_18)
    ))
(:constraints
  (always (not (pred_7 obj_15)))
)
)

; plan
1. (op_4 obj_14 obj_01)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_01)
   goals met: 0 of 1
2. (op_4 obj_01 obj_17)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_17)
   goals met: 0 of 1
3. (op_1 obj_17 obj_08)
   deleted: (pred_9 obj_08 obj_17) (pred_4)
   added: (pred_8 obj_08)
   goals met: 0 of 1
4. (op_4 obj_17 obj_16)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_16)
   goals met: 0 of 1
5. (op_4 obj_16 obj_11)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_18)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_18)
   goals met: 0 of 1
7. (op_5 obj_18 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_4) (pred_9 obj_08 obj_18)
   goals met: 1 of 1
